## 타이타닉 생존자 예측

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
import warnings
warnings.filterwarnings('ignore')

In [2]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

#### 1. 데이터 전처리

- Feature selection: 중복 필드 제거

In [3]:
df = df[['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare', 'embarked', 'who', 'deck']]
df.tail()

     survived  pclass     sex   age  sibsp  parch   fare embarked    who deck
886         0       2    male  27.0      0      0  13.00        S    man  NaN
887         1       1  female  19.0      0      0  30.00        S  woman    B
888         0       3  female   NaN      1      2  23.45        S  woman  NaN
889         1       1    male  26.0      0      0  30.00        C    man    C
890         0       3    male  32.0      0      0   7.75        Q    man  NaN

- 결측치 처리

In [4]:
# 어느 컬럼에 결측치가 있는지 확인
df.isna().sum()

survived      0
pclass        0
sex           0
age         177
sibsp         0
parch         0
fare          0
embarked      2
who           0
deck        688
dtype: int64

In [5]:
df.who.value_counts()

man      537
woman    271
child     83
Name: who, dtype: int64

In [6]:
# 나이 - man, woman, child 각각의 평균으로 대체
df[df.who == 'man'].age.fillna(df[df.who == 'man'].age.mean().round(1), inplace=True)
df[df.who == 'woman'].age.fillna(df[df.who == 'woman'].age.mean().round(1), inplace=True)
df[df.who == 'child'].age.fillna(df[df.who == 'child'].age.mean().round(1), inplace=True)

In [8]:
df[df.who == 'man'].age.mean().round(1), df[df.who == 'woman'].age.mean().round(1), df[df.who == 'child'].age.mean().round(1)

(33.2, 32.0, 6.4)

In [9]:
# embarked 결측치는 최빈값으로 대체
df.embarked.value_counts()

S    644
C    168
Q     77
Name: embarked, dtype: int64